src/Catalogs/ВариантыОтветов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВариантыОтветов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВариантыИнтерпретатора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОтветУчастника</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ВариантыОтветов/Ext/ManagerModule.bsl
#Если Сервер Или ВнешнееСоединение Или ТолстыйКлиентОбычноеПриложение Тогда
	
#Область ПрограммныйИнтерфейс

// Процедура - Обновить библиотеку ответов
//
Процедура ОбновитьБиблиотекуОтветов() Экспорт

	Вариант_Да = Справочники.ВариантыОтветов.НайтиПоНаименованию("Да");
	Если ЗначениеЗаполнено(Вариант_Да) Тогда 
		ЗаписатьВариант = Ложь;
		МассивВариантов = ПолучитьМассивВариантовОтветовДляВарианта_Да();
		Вариант_Объект 	= Вариант_Да.ПолучитьОбъект();
		Для Каждого ЭлементВариант Из МассивВариантов Цикл 
			СтрокаТЧ = Вариант_Объект.ВариантыИнтерпретатора.Найти(ЭлементВариант, "ОтветУчастника");
			Если СтрокаТЧ = Неопределено Тогда 
				ЗаполнитьЗначенияСвойств(Вариант_Объект.ВариантыИнтерпретатора.Добавить(), Новый Структура("ОтветУчастника", ЭлементВариант));
				ЗаписатьВариант = Истина;
			КонецЕсли;	
		КонецЦикла;	
		Если ЗаписатьВариант Тогда 
			Попытка
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Вариант_Объект);
			Исключение
				
		    КонецПопытки;
		КонецЕсли;
	КонецЕсли;	
	
	Вариант_Нет = Справочники.ВариантыОтветов.НайтиПоНаименованию("Нет");
	Если ЗначениеЗаполнено(Вариант_Нет) Тогда 
		ЗаписатьВариант = Ложь;
		МассивВариантов = ПолучитьМассивВариантовОтветовДляВарианта_Нет();
		Вариант_Объект 	= Вариант_Нет.ПолучитьОбъект();
		Для Каждого ЭлементВариант Из МассивВариантов Цикл 
			СтрокаТЧ = Вариант_Объект.ВариантыИнтерпретатора.Найти(ЭлементВариант, "ОтветУчастника");
			Если СтрокаТЧ = Неопределено Тогда 
				ЗаполнитьЗначенияСвойств(Вариант_Объект.ВариантыИнтерпретатора.Добавить(), Новый Структура("ОтветУчастника", ЭлементВариант));
				ЗаписатьВариант = Истина;
			КонецЕсли;	
		КонецЦикла;	
		Если ЗаписатьВариант Тогда 
			Попытка
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Вариант_Объект);
			Исключение
				
		    КонецПопытки;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

// Функция - Получить массив вариантов ответов для варианта да
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьМассивВариантовОтветовДляВарианта_Да()

	МассивВариантов = Новый Массив;
	МассивВариантов.Добавить("ДА");
	МассивВариантов.Добавить("OK");
	МассивВариантов.Добавить("СОГЛАСЕН");
	МассивВариантов.Добавить("ПОДТВЕРЖДАЮ");
	МассивВариантов.Добавить("ПРИЙДУ");	
	МассивВариантов.Добавить("ХОРОШО");
	МассивВариантов.Добавить("ХОР");
	МассивВариантов.Добавить("АГА");
	МассивВариантов.Добавить("УГУ");
	МассивВариантов.Добавить("+");
	МассивВариантов.Добавить("ПОЧЕМУ БЫ И НЕТ");
	МассивВариантов.Добавить("НЕ ОТМЕНЯЙ");
	МассивВариантов.Добавить("НЕ ОТМЕНЯЙТЕ");
	
	Возврат МассивВариантов;
	
КонецФункции

// Функция - Получить массив вариантов ответов для варианта нет
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьМассивВариантовОтветовДляВарианта_Нет()

	МассивВариантов = Новый Массив;
	МассивВариантов.Добавить("НЕТ");
	МассивВариантов.Добавить("НЕА");
	МассивВариантов.Добавить(", НЕ");
	МассивВариантов.Добавить("НЕ ХОЧУ");
	МассивВариантов.Добавить("НЕХОЧУ");
	МассивВариантов.Добавить("НЕ НАДО");
	МассивВариантов.Добавить("НЕКОГДА");	
	МассивВариантов.Добавить("ОТСТАНТЕ");
	МассивВариантов.Добавить("ОТВАЛИТЕ");
	МассивВариантов.Добавить("НЕ ПИШИТЕ МНЕ");
	МассивВариантов.Добавить(", ОТМЕНЯЮ");
	МассивВариантов.Добавить(", ОТМЕНЯЙТЕ");	
	МассивВариантов.Добавить("-");
	
	Возврат МассивВариантов;
	
КонецФункции

#КонецОбласти

 
	
#КонецЕсли
